health = 100
gold = 10

def status():
        print("صحتك هي", health)
        print("ذهبك هو ", gold)

print("اهلا بك في لعبة الفتى المغامر انت مغامر و هدفك قتل وحش اسطوري")

while health >0:
        status()
        
        print("1- الذهاب للغابة")
        print("2- الذهاب للكهف")
        print("3- الذهاب لقرية الاموات")
        
        c = int(input("اختار رقم: "))
        
        if c == 1:
                print("لقد ذخلت الغابة ")
                print("اوه ما هذا ... انه ذهب في الارض واو")
                gold = gold + 10
                print("لحظة لقد دسنا على غصن شجرة .. انه وحش اسطورييي")
                
                x = input("ماذا تفعل هل سوف تقاتله ؟ ( اكتب نعم او لا او لا شيء): ")
                
                if x == "نعم":
                        print("الوحش يهجم... لقد ضربنا دمك هو ", health)
                        health = health - 10
                        print("هيا اهجم ... لقد قتلناه احسنت")
                        gold = gold + 50
                        
                elif x == "لا":
                        print("هيا نهرببب!")
                        print("لحظة .. انه تنييين و لديه كرات نارية .. لقد ضربنااا")
                        health = health - 10
                        print("لقد هربنا اخيرا لاكن ... دمنا نقص كثيرا", health)
                        
                elif x == "لا شيء":
                        print("لقد متنا للاسف")
                        
                        
                        
                        
                elif c == 2:
                        print("لا ترفع صوتك")
                        print("انه ذهبب")
                        gold = gold + 23
                        print("هيا نخرج افضل المكان مخيف")
                        
                elif c == 3:
                        print("لقد وصلنا للقرية")
                        print("يا للهول انها مدمرة")
                        print("انه زومبي ... ليس 1 انهم جيش من الزومبي")
                        health = health - 20
                        print("هيا نهرب افضل...")
                        
                else:
                        print("من الافضل التخييم هنا")
